# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

my_list = [1, (6, 9, 7), 3, 4, 6.8, 'hello', ['a', 'b', 'c', 'd'], None]
print(type(my_list))
print(type(my_list[0]))
print(type(my_list[1]))
print(type(my_list[2]))
print(type(my_list[3]))
print(type(my_list[4]))
print(type(my_list[5]))
print(type(my_list[6]))
print(type(my_list[7]))
