# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

from sys import argv

file, hours, rate, bonus = argv


def salary_calc(r, h, b):

    return r * h + b


print(salary_calc(int(hours), int(rate ), int(bonus)))
