# 6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools. Обратите внимание, что создаваемый цикл не должен
# быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

from itertools import count
from itertools import cycle

for el in count(int(input('Введите стартовое число: '))):
    if el > 50:
        print('\nВыполнение цикла завершено')
        break
    else:
        print(el, end=' ')


stop = 0
arr = ['h', 'e', 'l', 'l', 'o', 'w', 'o', 'r', 'l', 'd']
for el in cycle(arr):
    if stop > 15:
        print('\nВыполнение программы завершено')
        break
    else:
        print(el, end='')
        stop += 1