# 2. Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
# Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
# Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна. Использовать формулу:
# длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом, толщиной в 1 см * число см толщины полотна.
# Проверить работу метода.
# Например: 20м * 5000м * 25кг * 5см = 12500 т

class Road:


    def __init__(self, length, width):
        self. _length = length
        self._width = width

    def mass_asphalt(self, mass, depth):
        return self._length * self._width * mass * depth


road_E_95 = Road(200, 20)
road_E_105 = Road(300, 12)
print(road_E_95.mass_asphalt(30, 5))
print(road_E_105.mass_asphalt(30, 5))


